//
//
//  AirPort Menu Extra - MenuExtra.strings
//  
//

"kAirPortScanningNetworksKey"			= "ネットワークをスキャン中...";
"kAirPortOtherKey"						= "ほかのネットワークに接続...";
"kAirPortCreateNetworkKey"				= "ネットワークを作成...";
"kAirPortTurnOffKey"					= "AirMac を切にする";
"kAirPortTurnOnKey"						= "AirMac を入にする";

"kAirPortConnectKey"					= "接続";
"kAirPortDisconnectKey"					= "接続解除";
"kAirPortDisconnectFromKey"				= "%@ との接続を解除";
"kAirPortCancelKey"						= "キャンセル";

"kAirPortStatusOnKey"					= "AirMac：入";
"kAirPortStatusOffKey"					= "AirMac：切";
"kAirPortStatusBusyKey"					= "AirMac：検索中...";
"kAirPortStatusScanningKey"				= "AirMac：ネットワークを検出中...";
"kAirPortNotConfiguredKey"				= "AirMac：構成されていません";
"kAirPortC2CNetworksKey"				= "“コンピュータとコンピュータ”ネットワーク";

// Open strings
"kAirPortOpenNetworkPrefsKey"			= "“ネットワーク”環境設定を開く...";
"kAirPortOpenInternetConnectKey"		= "“インターネット接続”を開く...";
"kAirPortOpenInternetSharingKey"		= "“インターネット共有”を開く...";
"kAirPortInternetSharingOnKey"			= "インターネット共有：入";

//  Connected states
"kAirPortNotConnectedKey"				= "接続されていません";
"kAirPortConnectingKey"					= "接続しています...";
"kAirPortConnectedKey"					= "接続中";

// PPP connect status
"kAirPortPPPModemKey"					= "AirMac モデム：%@";
"kAirPortPPPOEKey"						= "AirMac PPPoE：%@";
"kAirPortShowTimerKey"					= "接続時間を表示";
"kAirPortShowAnimatedStatusKey"			= "接続中に状況を表示";
"kAirPortDisconnectPPPKey"				= "現在のネットワーク接続を解除";
"kAirPortSetupUnconfiguredKey"			= "“%@”を設定...";

// PPP dialin control
"kAirPortPPPDialinDisconnectKey"		= "PPP ダイヤルインを接続解除";
"kAirPortPPPDialinStatusKey"			= "PPP ダイヤルイン：%@";
"kAirPortPPPTimeFormatterKey"			= "%1$.2d:%2$.2d:%3$.2d";			// "hh:mm:ss"
"kAirPortPPPLongTimeFormatterKey"		= "%1$dd %2$.2d:%3$.2d:%4$.2d";		// "d hh:mm:ss"

// error strings
"kAirPortNoNetworkCardKey"				= "AirMac カードがインストールされていません";
"kAirPortUnknownKey"					= "不明";
"kAirPortNotFoundKey"					= "見つかりません";

// alert strings
"kAirPortAlert"							= "警告：%@";
"kAirPortInternetUnavaliable"			= "インターネット未接続...";
"kAirPortCaptivePortal"					= "認証が必要です…";

// AX Descriptions / Values
"kAirPortAXDescriptionKey"				= "AirMac Menu Extra";
"kAirPortAXValueNoSignalKey"			= "信号なし";
"kAirPortAXValue1of4Key"				= "4 本のうち 1 本の信号";
"kAirPortAXValue1of4WithKey"			= "%@ の 4 本のうち 1 本の信号";
"kAirPortAXValue2of4Key"				= "4 本のうち 2 本の信号";
"kAirPortAXValue2of4WithKey"			= "%@ の 4 本のうち 2 本の信号";
"kAirPortAXValue3of4Key"				= "4 本のうち 3 本の信号";
"kAirPortAXValue3of4WithKey"			= "%@ の 4 本のうち 3 本の信号";
"kAirPortAXValue4of4Key"				= "4 本のうち 4 本の信号";
"kAirPortAXValue4of4WithKey"			= "%@ の 4 本のうち 4 本の信号";
"kAirPortAXValueC2CKey"					= "コンピュータとコンピュータ";
"kAirPortAXValueSoftwareBaseStationKey"	= "ソフトウェア・ベースステーション";
"kAirPortAXValueNotEnabledKey"			= "AirMac が有効になっていません";

// Network Connection and Configuration
"kAirPortCurrentNetworkKey"				= "現在のネットワーク";
"kAirPortNoNetworkKey"					= "ネットワークが選択されていません";
"kAirPortNoNetworksFoundKey"			= "ネットワークが見つかりません";
"kAirPortConfigureBaseStationKey"		= "ベースステーションを構成...";

// Extra Info
"kAirPortChannelInfoKey"				= "チャンネル：%@";
"kAirPortSignalInfoKey"					= "RSSI：%@";
"kAirPortRateInfoKey"					= "転送レート：%@";
"kAirPortMCSIndexInfoKey"				= "MCS インデックス：%@";
"kAirPortSecurityInfoKey"				= "セキュリティ：%@";
"kAirPortNetworkTipKey"					= "RSSI：%@\nセキュリティ：%@";
"kAirPortBSSIDFormatKey"				= "BSSID：%.2x:%.2x:%.2x:%.2x:%.2x:%.2x";
"kAirPortBSSIDInfoKey"					= "BSSID：%@";
"kAirPortPHYModeInfoKey"				= "PHY モード：%@";
"kAirPortNetworkTypeInfoKey"			= "ネットワークのタイプ：%@";

// Network Modes
"kAirPortNetworkTypeIBSS"				= "IBSS";
"kAirPortNetworkTypeInfrastructure"		= "インフラストラクチャ";
"kAirPortNetworkTypeC2C"				= "コンピュータとコンピュータ";
"kAirPortNetworkTypeInternetSharing"	= "AirMac インターネット共有";

// these need their own table
"kGroupSecurityOpenKey"					= "公開ネットワーク";
"kGroupSecurityClosedKey"				= "セキュリティ保護されたネットワーク";
"kGroupSecurityIBSSKey"					= "装置";

"kGroupModeAPKey"						= "アクセスポイント・ネットワーク";
"kGroupModeIBSSKey"						= "装置";

"kGroupSignalStrongKey"					= "強い信号";
"kGroupSignalNormalKey"					= "標準の信号";
"kGroupSignalWeakKey"					= "弱い信号";

"kGroupBand24GHzKey"					= "2.4 GHz";
"kGroupBand5GHzKey"						= "5 GHz";

// End of Localizable.strings

